# -*- coding: utf-8 -*-

cat_map = {
    '篮球': 100,
    '体育趣闻': 101,
    '体育教学': 102,
    '足球': 103,
    '综合体育': 104,
    '奥运': 105,
    '功夫搏击': 106,
    '极限运动': 107,
    '广告': 200,
    '创意': 201,
    '自拍': 202,
    '公益短片': 203,
    '青春': 204,
    '绝活': 205,
    '军情解读': 300,
    '军事节目': 301,
    '武器装备': 302,
    '战争历史': 303,
    '原创动画': 400,
    '动漫周边': 401,
    '连载动画': 402,
    '宅文化': 403,
    '明星资讯': 500,
    '饭拍饭制': 501,
    '儿歌': 600,
    '益智': 601,
    '少儿节目': 602,
    '少儿动画': 603,
    '爆笑原创': 700,
    '段子剧': 701,
    '糗事': 702,
    '爆笑动物': 703,
    '相声小品': 704,
    '奇趣': 705,
    '熊孩子': 706,
    '爆笑恶搞': 707,
    '鬼畜': 708,
    '神回复': 709,
    '公开课': 800,
    '校园内外': 801,
    '语言学习': 802,
    '考试': 803,
    '职场教育': 804,
    '演讲': 805,
    '人生课堂': 806,
    '技能教学': 807,
    '知识百科': 808,
    '产品资讯': 900,
    '数码其他': 901,
    '评测': 902,
    '智能生活': 903,
    '宗教': 1000,
    '读书': 1001,
    '艺术': 1002,
    '历史': 1003,
    '文化': 1004,
    '正能量': 1100,
    '奇闻趣事': 1101,
    '社会百态': 1102,
    '人物访谈': 1103,
    '法制': 1104,
    '国内时政': 1105,
    '国际时政': 1106,
    '国际社会': 1107,
    '交通': 1108,
    '旅行趣闻': 1200,
    '旅行攻略': 1201,
    '旅途风光': 1202,
    '时尚资讯': 1300,
    '时尚大片': 1301,
    '男士时尚': 1302,
    '美妆': 1303,
    '潮流奢品': 1304,
    '穿搭': 1305,
    'T台秀场': 1306,
    '喂养': 1400,
    '保健护理': 1401,
    '萌宝': 1402,
    '孕产': 1403,
    '早教': 1404,
    '新车速递': 1500,
    '试驾评测': 1501,
    '玩车': 1502,
    '车模': 1503,
    '用车': 1504,
    '汽车资讯': 1505,
    '汽车其他': 1506,
    '摩托车': 1507,
    '手机游戏': 1600,
    '游戏周边': 1601,
    '达人解说': 1602,
    '游戏节目': 1603,
    '网络游戏': 1604,
    '电竞赛事': 1605,
    '单机游戏': 1606,
    '游戏展会': 1607,
    '宠物': 1700,
    '两性': 1701,
    '星座': 1702,
    '风水命理': 1703,
    '情感': 1704,
    '健康': 1705,
    '休闲': 1706,
    '生活窍门': 1707,
    '健身': 1708,
    '家居': 1709,
    '心灵': 1710,
    '彩票': 1711,
    '摄影': 1712,
    '电影资讯': 1800,
    '微电影': 1801,
    '电影周边': 1802,
    '影评': 1803,
    '电影剪辑': 1804,
    '电视剧剪辑': 1900,
    '网络剧': 1901,
    '电视剧片花': 1902,
    '剧集周边': 1903,
    '科学其他': 2000,
    '科学实验': 2001,
    '太空探索': 2002,
    '科普': 2003,
    '科技前沿': 2100,
    '互联网': 2101,
    '机械': 2102,
    '航空航天': 2103,
    '科技奇趣': 2104,
    '美食纪录片': 2200,
    '自然纪录片': 2201,
    '历史纪录片': 2202,
    '社会纪录片': 2203,
    '旅游纪录片': 2204,
    '军事纪录片': 2205,
    '人文纪录片': 2206,
    '舞蹈教学': 2300,
    '舞蹈工作室': 2301,
    '舞蹈达人': 2302,
    '明星热舞': 2303,
    '公司': 2400,
    '创业': 2401,
    '经济': 2402,
    '消费': 2403,
    '房地产': 2404,
    '投资': 2405,
    '理财': 2406,
    '财经人物': 2407,
    '产经': 2408,
    '股市': 2409,
    '金融': 2410,
    '收藏': 2411,
    '恶搞音乐': 2500,
    '演奏': 2501,
    '翻唱': 2502,
    '音乐节目': 2503,
    '演唱会': 2504,
    '影视音乐': 2505,
    '明星MV': 2506,
    '达人MV': 2507,
    '喊麦': 2508,
    '音乐牛人': 2509,
    '广场舞教学': 2600,
    '广场舞欣赏': 2601,
    '美味食谱': 2700,
    '烘焙': 2701,
    '吃播大胃王': 2702,
    '美食猎奇': 2703,
    '音乐真人秀': 2800,
    '喜剧节目': 2801,
    '脱口秀': 2802,
    '真人秀': 2803,
    '情感节目': 2804,
    '魔术': 2805,
    '戏曲': 2806,
    '舞台剧': 2807,
    '其他综艺': 2808}

cat_groups = [
    {
        'cat': '电影',
        'subcats': ['电影周边', '电影资讯', '电影剪辑', '微电影', '影评']},
    {
        'cat': '电视剧',
        'subcats': ['电视剧剪辑', '电视剧片花', '剧集周边', '网络剧']},
    {
        'cat': '动漫',
        'subcats': ['连载动画', '原创动画', '动漫周边', '宅文化']},
    {
        'cat': '新闻',
        'subcats': ['国内时政', '国际时政', '国际社会', '社会百态', '人物访谈', '奇闻趣事', '法制', '交通', '正能量']},
    {
        'cat': '娱乐',
        'subcats': ['明星资讯', '饭拍饭制']
    },
    {
        'cat': '综艺',
        'subcats': ['音乐真人秀', '喜剧节目', '脱口秀', '真人秀', '情感节目', '舞台剧', '魔术', '戏曲', '其他综艺']
    },
    {
        'cat': '搞笑',
        'subcats': ['鬼畜', '奇趣', '段子剧', '神回复', '熊孩子', '糗事', '爆笑原创', '爆笑动物', '爆笑恶搞', '相声小品']
    },
    {
        'cat': '体育',
        'subcats': ['篮球', '足球', '体育趣闻', '体育教学', '综合体育', '功夫搏击', '极限运动']
    },
    {
        'cat': '音乐',
        'subcats': ['演唱会', '音乐节目', '恶搞音乐', '翻唱', '演奏', '影视音乐', '明星MV', '达人MV', '喊麦', '音乐牛人']
    },
    {
        'cat': '舞蹈',
        'subcats': ['明星热舞', '舞蹈达人', '舞蹈教学', '舞蹈工作室']
    },
    {
        'cat': '广场舞',
        'subcats': ['广场舞教学', '广场舞欣赏']
    },
    {
        'cat': '少儿',
        'subcats': ['儿歌', '益智', '少儿动画', '少儿节目']
    },
    {
        'cat': '游戏',
        'subcats': ['手机游戏', '网络游戏', '单机游戏', '游戏节目', '达人解说', '电竞赛事', '游戏展会', '游戏周边']
    },
    {
        'cat': '财经',
        'subcats': ['公司', '创业', '经济', '消费', '投资', '理财', '产经', '股市', '金融', '房地产', '财经人物', '收藏']
    },
    {
        'cat': '军事',
        'subcats': ['军情解读', '军事节目', '武器装备', '战争历史']
    },
    {
        'cat': '美食',
        'subcats': ['美味食谱', '烘焙', '吃播大胃王', '美食猎奇']
    },
    {
        'cat': '生活',
        'subcats': ['宠物', '两性', '星座', '情感', '健康', '休闲', '健身', '家居', '生活窍门', '风水命理', '心灵', '彩票', '摄影']  # noqa
    },
    {
        'cat': '时尚',
        'subcats': ['时尚资讯', '时尚大片', '美妆', '潮流奢品', '男士时尚', 'T台秀场', '穿搭']
    },
    {
        'cat': '育儿',
        'subcats': ['孕产', '喂养', '早教', '萌宝', '保健护理']
    },
    {
        'cat': '旅游',
        'subcats': ['旅行攻略', '旅行趣闻', '旅途风光']
    },
    {
        'cat': '汽车',
        'subcats': ['新车速递', '试驾评测', '汽车资讯', '用车', '玩车', '车模', '摩托车', '汽车其他']
    },
    {
        'cat': '纪录片',
        'subcats': ['美食纪录片', '自然纪录片', '历史纪录片', '社会纪录片', '旅游纪录片', '军事纪录片', '人文纪录片']
    },
    {
        'cat': '教育',
        'subcats': ['演讲', '公开课', '职场教育', '考试', '技能教学', '校园内外', '人生课堂', '语言学习', '知识百科']
    },
    {
        'cat': '文化历史',
        'subcats': ['读书', '艺术', '宗教', '历史', '文化']
    },
    {
        'cat': '数码',
        'subcats': ['评测', '产品资讯', '智能生活', '数码其他']
    },
    {
        'cat': '科学',
        'subcats': ['科学实验', '太空探索', '科普', '科学其他']
    },
    {
        'cat': '科技',
        'subcats': ['机械', '互联网', '科技前沿', '科技奇趣', '航空航天']
    },
    {
        'cat': '其他',
        'subcats': ['广告', '创意', '自拍', '公益短片', '青春', '绝活']
    }]
